public_html/c&c++/C++ Standard Library.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>C++ Standard headers</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="C++ Standard headers"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-07-12 00:15:28 HKT"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">C++ Standard headers</h1>



<p>
C++ Standard headers
</p>
<p>
The following files contain the declarations of the C++ Standard Library.
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Containers</a></li>
<li><a href="#sec-2">2 General</a></li>
<li><a href="#sec-3">3 Numerics</a></li>
<li><a href="#sec-4">4 Language support</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Containers</h2>
<div class="outline-text-2" id="text-1">

<p>&lt;array&gt;<br/>
New in C++11 and TR1. Provides the container class template std::array, a container for a fixed sized array.
</p>
<p>
&lt;bitset&gt;<br/>
Provides the specialized container class std::bitset, a bit array.
</p>
<p>
&lt;deque&gt;<br/>
Provides the container class template std::deque, a double-ended queue.
</p>
<p>
&lt;forward_list&gt;<br/>
New in C++11 and TR1. Provides the container class template std::forward<sub>list</sub>, a singly linked list.
</p>
<p>
&lt;list&gt;<br/>
Provides the container class template std::list, a doubly linked list.
</p>
<p>
&lt;map&gt;<br/>
Provides the container class templates std::map and std::multimap, sorted associative array and multimap.
</p>
<p>
&lt;queue&gt;<br/>
Provides the container adapter class std::queue, a single-ended queue, and std::priority<sub>queue</sub>, a priority queue.
</p>
<p>
&lt;set&gt;<br/>
Provides the container class templates std::set and std::multiset, sorted associative containers or sets.
</p>
<p>
&lt;stack&gt;<br/>
Provides the container adapter class std::stack, a stack.
</p>
<p>
&lt;unordered_map&gt;<br/>
New in C++11 and TR1. Provides the container class template std::unordered<sub>map</sub> and std::unordered<sub>multimap</sub>, hash tables.
</p>
<p>
&lt;unordered_set&gt;<br/>
New in C++11 and TR1. Provides the container class template std::unordered<sub>set</sub> and std::unordered<sub>multiset</sub>.
</p>
<p>
&lt;vector&gt;
Provides the container class template std::vector, a dynamic array.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> General</h2>
<div class="outline-text-2" id="text-2">


<p>
&lt;algorithm&gt;
Provides definitions of many container algorithms.
</p>
<p>
&lt;functional&gt;
Provides several function objects, designed for use with the standard algorithms.
</p>
<p>
&lt;iterator&gt;
Provides classes and templates for working with iterators.
</p>
<p>
&lt;locale&gt;
Provides classes and templates for working with locales.
</p>
<p>
&lt;memory&gt;
Provides facilities for memory management in C++, including the class template std::unique<sub>ptr</sub>.
</p>
<p>
&lt;stdexcept&gt;
Contains standard exception classes such as std::logic<sub>error</sub> and std::runtime<sub>error</sub>, both derived from std::exception.
</p>
<p>
&lt;tuple&gt;
New in C++11 and TR1. Provides a class template std::tuple, a tuple.
</p>
<p>
&lt;utility&gt;
Provides the template class std::pair, for working with pairs (two-member tuples) of objects.
[edit]Strings
</p>
<p>
&lt;string&gt;
Provides the C++ standard string classes and templates.
</p>
<p>
&lt;regex&gt;
Provides utilities for pattern matching strings using regular expressions.
[edit]Streams and Input/Output
</p>
<p>
&lt;fstream&gt;
Provides facilities for file-based input and output. See fstream.
</p>
<p>
&lt;iomanip&gt;
Provides facilities to manipulate output formatting, such as the base used when formatting integers and the precision of floating point values.
</p>
<p>
&lt;ios&gt;
Provides several types and functions basic to the operation of iostreams.
</p>
<p>
&lt;iosfwd&gt;
Provides forward declarations of several I/O-related class templates.
</p>
<p>
&lt;iostream&gt;
Provides C++ input and output fundamentals. See iostream.
</p>
<p>
&lt;istream&gt;
Provides the template class std::istream and other supporting classes for input.
</p>
<p>
&lt;ostream&gt;
Provides the template class std::ostream and other supporting classes for output.
</p>
<p>
&lt;sstream&gt;
Provides the template class std::sstream and other supporting classes for string manipulation.
</p>
<p>
&lt;streambuf&gt;
Provides reading and writing functionality to/from certain types of character sequences, such as external files or strings.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Numerics</h2>
<div class="outline-text-2" id="text-3">


<p>
&lt;complex&gt;
Provides class template std::complex and associated functions for working with complex numbers.
</p>
<p>
&lt;numeric&gt;
Provides algorithms for numerical processing
</p>
<p>
&lt;random&gt;
New in C++11. 26.5-1 This subclase defines a facility for generating (pseudo-)random numbers.
</p>
<p>
&lt;valarray&gt;
Provides the template class std::valarray, an array class optimized for numeric processing.
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Language support</h2>
<div class="outline-text-2" id="text-4">


<p>
&lt;exception&gt;
Provides several types and functions related to exception handling, including std::exception, the base class of all exceptions thrown by the Standard Library.
</p>
<p>
&lt;limits&gt;
Provides the template class std::numeric<sub>limits</sub>, used for describing properties of fundamental numeric types.
</p>
<p>
&lt;new&gt;
Provides operators new and delete and other functions and types composing the fundamentals of C++ memory management.
</p>
<p>
&lt;typeinfo&gt;
Provides facilities for working with C++ run-time type information.
[edit]Thread support library
</p>
<p>
&lt;thread&gt;
New in C++11. Provide class and namespace for working with threads.
</p>
<p>
&lt;mutex&gt;
New in C++11. 30.4-1 This section provides mechanisms for mutual exclusion: mutexes, locks, and call once.
</p>
<p>
&lt;condition<sub>variable&gt</sub>;
New in C++11. 30.5-1 Condition variables provide synchronization primitives used to block a thread until notified by some other thread that some condition is met or until a system time is reached.
</p>
<p>
&lt;future&gt;
New in C++11. 30.6.1-1 Describes components that a C++ program can use
to retrieve in one thread the result (value or exception) from a
function that has run in the same thread or another thread.
</p>
<p>
More: <a href="http://en.wikipedia.org/wiki/C++_Standard_Library">wiki</a> 
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-07-12 00:15:28 HKT</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator">Org version 7.8.09 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
